In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('cleaned_data')
df.drop(['Unnamed: 0'], axis=1, inplace=True)

In [3]:
df.head()

,company,title,totalyearlycompensation,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,gender,Masters_Degree,...,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic,state,in_top_15,education,race
0,Google,Software Engineer,400000,5.0,5.0,210000.0,145000.0,45000.0,Male,0,...,0,1,0,0,0,0,CA,True,PHD,Asian
1,Microsoft,Software Engineer,136000,3.0,2.0,124000.0,1000.0,11000.0,Male,0,...,0,0,0,1,0,0,WA,True,Bachelors,Two
2,Google,Software Engineer,337000,6.0,6.0,177000.0,125000.0,36000.0,Male,0,...,0,1,0,0,0,0,CA,True,Bachelors,Asian
3,Microsoft,Software Engineer,222000,4.0,4.0,164000.0,38000.0,20000.0,Male,1,...,0,1,0,0,0,0,WA,True,Masters,Asian
4,Blend,Software Engineer,187000,5.0,0.0,165000.0,22000.0,0.0,Male,0,...,0,0,1,0,0,0,CA,False,Bachelors,White

In [4]:
df.columns

Index(['company', 'title', 'totalyearlycompensation', 'yearsofexperience',
       'yearsatcompany', 'basesalary', 'stockgrantvalue', 'bonus', 'gender',
       'Masters_Degree', 'Bachelors_Degree', 'Doctorate_Degree', 'Highschool',
       'Some_College', 'Race_Asian', 'Race_White', 'Race_Two_Or_More',
       'Race_Black', 'Race_Hispanic', 'state', 'in_top_15', 'education',
       'race'],
      dtype='object')

In [5]:
#state, title, race, education, company, gender, experience
df.drop(['company'], axis=1, inplace=True)

In [6]:
def convert(years):
    if years == 0:
        return 'NO EXPERIENCE'
    elif 1 <= years <= 3:
        return 'LITTLE EXPERIENCE'
    elif 4 <= years <= 6:
        return 'MEDIUM EXPERIENCE'
    else:
        return 'VERY EXPERIENCED'

In [7]:
df['experience'] = df['yearsofexperience'].apply(convert)

In [8]:
input = ['state', 'title', 'race', 'education', 'gender', 'experience', 'in_top_15']
filler = df.groupby(by = input)['yearsatcompany', 'basesalary', 'stockgrantvalue', 'bonus'].mean()
filler.reset_index(inplace=True)
filler

/tmp/ipykernel_15133/2292288465.py:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  filler = df.groupby(by = input)['yearsatcompany', 'basesalary', 'stockgrantvalue', 'bonus'].mean()

,state,title,race,education,gender,experience,in_top_15,yearsatcompany,basesalary,stockgrantvalue,bonus
0,CA,Business Analyst,Asian,Bachelors,Female,LITTLE EXPERIENCE,False,0.800000,98000.000000,10600.000000,10600.000000
1,CA,Business Analyst,Asian,Bachelors,Female,LITTLE EXPERIENCE,True,1.666667,87333.333333,1000.000000,8333.333333
2,CA,Business Analyst,Asian,Bachelors,Female,MEDIUM EXPERIENCE,False,0.500000,130000.000000,5000.000000,5000.000000
3,CA,Business Analyst,Asian,Bachelors,Female,MEDIUM EXPERIENCE,True,1.000000,140000.000000,31000.000000,21000.000000
4,CA,Business Analyst,Asian,Bachelors,Female,NO EXPERIENCE,True,0.000000,79500.000000,0.000000,7000.000000
...,...,...,...,...,...,...,...,...,...,...,...
3382,WA,Technical Program Manager,White,Masters,Male,VERY EXPERIENCED,False,8.428571,162571.428571,5714.285714,16857.142857
3383,WA,Technical Program Manager,White,Masters,Male,VERY EXPERIENCED,True,5.142857,182571.428571,53785.714286,33857.142857
3384,WA,Technical Program Manager,White,PHD,Male,VERY EXPERIENCED,True,7.000000,185000.000000,232500.000000,20000.000000
3385,WA,Technical Program Manager,White,Some,Female,VERY EXPERIENCED,True,16.000000,182000.000000,40000.000000,42000.000000
3386,WA,Technical Program Manager,White,Some,Male,VERY EXPERIENCED,True,2.000000,206000.000000,36750.000000,35250.000000

In [9]:
filler.reset_index(inplace=True)

In [10]:
filler[(filler['state'] == 'CA') & (filler['title'] == 'Business Analyst') & (filler['race'] == 'Asian') & (filler['gender'] == 'Female') & (filler['in_top_15'] == True) & (filler['education'] == 'PHD')]

Empty DataFrame
Columns: [index, state, title, race, education, gender, experience, in_top_15, yearsatcompany, basesalary, stockgrantvalue, bonus]
Index: []

In [11]:
#change experience from numerical to categorical
#no = 0 years
#little = 1-3
#medium = 4-6
#a lot = 6+

In [12]:
df.head()

,title,totalyearlycompensation,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,gender,Masters_Degree,Bachelors_Degree,...,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic,state,in_top_15,education,race,experience
0,Software Engineer,400000,5.0,5.0,210000.0,145000.0,45000.0,Male,0,0,...,1,0,0,0,0,CA,True,PHD,Asian,MEDIUM EXPERIENCE
1,Software Engineer,136000,3.0,2.0,124000.0,1000.0,11000.0,Male,0,1,...,0,0,1,0,0,WA,True,Bachelors,Two,LITTLE EXPERIENCE
2,Software Engineer,337000,6.0,6.0,177000.0,125000.0,36000.0,Male,0,1,...,1,0,0,0,0,CA,True,Bachelors,Asian,MEDIUM EXPERIENCE
3,Software Engineer,222000,4.0,4.0,164000.0,38000.0,20000.0,Male,1,0,...,1,0,0,0,0,WA,True,Masters,Asian,MEDIUM EXPERIENCE
4,Software Engineer,187000,5.0,0.0,165000.0,22000.0,0.0,Male,0,1,...,0,1,0,0,0,CA,False,Bachelors,White,MEDIUM EXPERIENCE

In [13]:
#create groupby seven inputs & mean of outputs
input = ['state', 'title', 'race', 'gender', 'experience', 'education', 'in_top_15']
filler = df.groupby(by = input)['yearsatcompany', 'basesalary', 'stockgrantvalue', 'bonus'].mean()
filler.reset_index(inplace = True)

/tmp/ipykernel_15133/1973704127.py:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  filler = df.groupby(by = input)['yearsatcompany', 'basesalary', 'stockgrantvalue', 'bonus'].mean()

In [0]:
def findfillerdata(state, title, race, gender, exp, edu, intop15):